app/controllers/source_controller.rb

  def index
    @sources = Source.all
---
SELECT "sources".* FROM "sources"